goods = {
    'Лампа': '12345',
    'Стол': '23456',
    'Диван': '34567',
    'Стул': '45678',
}

store = {
    '12345': [                                # Лампа
        {'quantity': 27, 'price': 42},
    ],
    '23456': [                                # Стол
        {'quantity': 22, 'price': 510},
        {'quantity': 32, 'price': 520},
    ],
    '34567': [                                # Диван
        {'quantity': 2, 'price': 1200},
        {'quantity': 1, 'price': 1150},
    ],
    '45678': [                                # Стул
        {'quantity': 50, 'price': 100},
        {'quantity': 12, 'price': 95},
        {'quantity': 43, 'price': 97},
    ],
}

for name_prod, code in goods.items():  # Пробегаемся по словарю "товары" для получением названия товара и его кода
    quantity = 0  # инициализация переменной для подсчета количества товара
    price = 0  # инициализация переменной для подсчета стоимости товара
    cost = 0  # инициализация переменной для подсчета ОБЩЕЙ стоимости товара

    for goods in store[code]: # получение списка на складе по коду товара
        quantity += goods['quantity'] # подсчет количества товара
        price = goods['price'] # подсчет стоимости товара
        cost += quantity * price # подсчет ОБЩЕЙ стоимости товара
    print(name_prod, " - ", quantity, " шт, ", cost, " руб") # вывод на консоль количества и стоимости товара на складе

